In [ ]:
import pandas as pd

In [3]:
import pandas as pd  

data = {
    '김철수': 85,
    '이영희': 92,
    '박민수': 78,
    '최지연': 96
}

scores = pd.Series(data)

print(scores)

김철수    85
이영희    92
박민수    78
최지연    96
dtype: int64

In [ ]:
import pandas as pd

In [4]:
import pandas as pd

data = {
    '김철수': 85,
    '이영희': 92,
    '박민수': 78,
    '최지연': 96
}
scores = pd.Series(data)

# 1. 이영희의 점수 출력
print("1. 이영희의 점수:", scores['이영희'])

# 2. 90점 이상인 학생 필터링
high_scores = scores[scores >= 90]
print("\n2. 90점 이상인 학생들:\n", high_scores)

# 3. 모든 점수에 5점 더하기
added_scores = scores + 5
print("\n3. 모든 점수에 5점 더한 결과:\n", added_scores)

1. 이영희의 점수: 92

2. 90점 이상인 학생들:
 이영희    92
최지연    96
dtype: int64

3. 모든 점수에 5점 더한 결과:
 김철수     90
이영희     97
박민수     83
최지연    101
dtype: int64

In [5]:
import pandas as pd

# 열이름을 key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 판다스 DataFrame() 함수로 딕셔너리를 데이터프레임으로 변환. 변수 df에 저장.
df = pd.DataFrame(dict_data)

# df의 자료형 출력
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [6]:
# 변수 df에 저장되어 있는 데이터프레임 객체를 출력
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [7]:
# 주피터 환경에서 변수 출력
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [8]:
import pandas as pd

# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                   index=['준서', '예은'],
                   columns=['나이', '성별', '학교'])

# 데이터프레임 출력하기
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [9]:
#행 인덱스 확인하기
print(df.index)

Index(['준서', '예은'], dtype='object')

In [10]:
#열 이름 확인하기
print(df.columns)

Index(['나이', '성별', '학교'], dtype='object')

In [11]:
# 행 인덱스, 열 이름 변경하기
df.index=['학생1', '학생2']
df.columns=['연령', '남녀', '소속']

print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [12]:
print(df.index)      #행 인덱스

Index(['학생1', '학생2'], dtype='object')

In [13]:
print(df.columns)    #열 이름

Index(['연령', '남녀', '소속'], dtype='object')

In [14]:
import pandas as pd

# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']],
                   index=['준서', '예은'],
                   columns=['나이', '성별', '학교'])

# 행 인덱스, 열 이름 확인하기
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [15]:
# 열 이름 중, '나이'를 '연령'으로, '성별'을 '남녀'로, '학교'를 '소속'으로 바꾸기
df = df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'})

# df 출력(변경 후)
print(df)

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [16]:
# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df = df.rename(index={'준서':'학생1', '예은':'학생2' })

# df 출력(변경 후)
print(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [17]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [18]:
# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 행(row)을 삭제
df2 = df.copy()
df2 = df2.drop('우현')
print(df2)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [19]:
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2개 행(row)을 삭제
df3 = df.copy()
df3 = df3.drop(['우현', '인아'], axis=0)
print(df3)

    수학  영어  음악   체육
서준  90  98  85  100

In [20]:
# 데이터프레임 df를 복제하여 변수 df4에 저장. df4의 2개 행(row)을 삭제
df4 = df.copy()
df4 = df4.drop(['우현', '인아'], axis='index')
print(df4)

    수학  영어  음악   체육
서준  90  98  85  100

In [21]:
# 데이터프레임 df를 복제하여 변수 df5에 저장. df5의 1개 행(row)을 삭제
df5 = df.copy()
df5 = df5.drop(index=['우현'])
print(df5)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [22]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [23]:
# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 열(column)을 삭제
df2 = df.copy()
df2 = df2.drop('수학', axis=1)
print(df2)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [24]:
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2개 열(column)을 삭제
df3 = df.copy()
df3 = df3.drop(['영어', '음악'], axis=1)
print(df3)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [26]:
# 데이터프레임 df를 복제하여 변수 df4에 저장. df4의 2개 행(row)을 삭제
df4 = df.copy()
df4 = df4.drop(['영어', '음악'], axis='columns')
print(df4)

    수학   체육
서준  90  100
우현  80   90
인아  70   90

In [27]:
# 데이터프레임 df를 복제하여 변수 df5에 저장. df5의 1개 행(row)을 삭제
df5 = df.copy()
df5 = df5.drop(columns=['수학'])
print(df5)

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [ ]:
import pandas as pd

In [28]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

# 데이터프레임 출력
print(df)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [29]:
# 행 인덱스를 사용하여 행 1개를 선택
label1 = df.loc['서준']    # loc 인덱서 활용
position1 = df.iloc[0]     # iloc 인덱서 활용
print(label1)
print('\n')
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64


수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [30]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준', '우현']]
position2 = df.iloc[[0, 1]]
print(label2)
print('\n')
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [31]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]
print(label3)
print('\n')
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100

In [32]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
print(df)
print('\n')
print(type(df))

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90


<class 'pandas.core.frame.DataFrame'>

In [33]:
# '수학' 점수 데이터만 선택. 변수 math1에 저장
math1 = df['수학']
print(math1)
print('\n')
print(type(math1))

0    90
1    80
2    70
Name: 수학, dtype: int64


<class 'pandas.core.series.Series'>

In [34]:
# '영어' 점수 데이터만 선택. 변수 english에 저장
english = df.영어
print(english)
print('\n')
print(type(english))

0    98
1    89
2    95
Name: 영어, dtype: int64


<class 'pandas.core.series.Series'>

In [35]:
# '음악', '체육' 점수 데이터를 선택. 변수 music_gym 에 저장
music_gym = df[['음악', '체육']]
print(music_gym)
print('\n')
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100   90


<class 'pandas.core.frame.DataFrame'>

In [36]:
# '수학' 점수 데이터만 선택. 변수 math2에 저장
math2 = df[['수학']]
print(math2)
print('\n')
print(type(math2))

   수학
0  90
1  80
2  70


<class 'pandas.core.frame.DataFrame'>

In [37]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df = df.set_index('이름')
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [38]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
print(a)
b = df.iloc[0, 2]
print(b)

85
85

In [39]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수)
c = df.loc['서준', ['음악', '체육']]
print(c)
d = df.iloc[0, [2, 3]]
print(d)
e = df.loc['서준', '음악':'체육']
print(e)
f = df.iloc[0, 2:]
print(f)

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [40]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수)
g = df.loc[['서준', '우현'], ['음악', '체육']]
print(g)
h = df.iloc[[0, 1], [2, 3]]
print(h)
i = df.loc['서준':'우현', '음악':'체육']
print(i)
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90

In [41]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [42]:
# 데이터프레임 df에 '국어' 점수 열(column)을 추가. 데이터 값은 80 지정
df['국어'] = 80
print(df)

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [43]:
# 데이터프레임 df에 '미술' 점수 열(column)을 추가. 데이터는 [80, 90, 100]을 지정
df['미술'] = [80, 90, 100]
print(df)

   이름  수학  영어   음악   체육  국어   미술
0  서준  90  98   85  100  80   80
1  우현  80  89   95   90  80   90
2  인아  70  95  100   90  80  100

In [44]:
import pandas as pd

# 학생 정보 데이터
data = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}

# DataFrame 생성
df = pd.DataFrame(data)

print(df)

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96

In [45]:
import pandas as pd

# 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}
df = pd.DataFrame(data)

# 1. 기본 정보 확인
print("기본 정보 (info):")
df.info()
print("\n기술 통계 (describe):")
print(df.describe())
print("\n데이터프레임의 shape:")
print(df.shape)

# 2. 첫 2행 출력
print("\n첫 2행:")
print(df.head(2))

# 3. '점수' 열만 선택해서 출력
print("\n'점수' 열:")
print(df['점수'])

기본 정보 (info):
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   성별      4 non-null      object
 3   점수      4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

기술 통계 (describe):
              나이         점수
count   4.000000   4.000000
mean   20.000000  87.750000
std     0.816497   7.932003
min    19.000000  78.000000
25%    19.750000  83.250000
50%    20.000000  88.500000
75%    20.250000  93.000000
max    21.000000  96.000000

데이터프레임의 shape:
(4, 4)

첫 2행:
    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92

'점수' 열:
0    85
1    92
2    78
3    96
Name: 점수, dtype: int64

In [50]:
# '이영희'의 모든 정보 출력
print(df.loc[df['이름'] == '이영희'])

Empty DataFrame
Columns: [이름, 수학, 영어, 음악, 체육]
Index: []

In [51]:
import pandas as pd

# 학생 정보 데이터
data = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}

# DataFrame 생성
df = pd.DataFrame(data)

print(df)

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96

In [52]:
# '이영희'의 모든 정보 출력
print(df.loc[df['이름'] == '이영희'])

    이름  나이 성별  점수
1  이영희  19  여  92

In [53]:
# 첫 번째(0), 세 번째(2) 행의 '이름'과 '점수'만 출력
print(df.iloc[[0, 2]][['이름', '점수']])

    이름  점수
0  김철수  85
2  박민수  78

In [54]:
# 나이가 20살인 학생들만 출력
print(df[df['나이'] == 20])

    이름  나이 성별  점수
0  김철수  20  남  85
3  최지연  20  여  96

In [55]:
import pandas as pd

# 기존 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}
df = pd.DataFrame(data)

# 1. 새로운 학생 '정민호(22세, 남, 88점)' 추가
df.loc[len(df)] = ['정민호', 22, '남', 88]

# 2. 모든 학생의 점수에 3점 더하기
df['점수'] = df['점수'] + 3

# 3. '등급' 열 추가 (90점 이상: A, 80~89점: B, 80점 미만: C)
def get_grade(score):
    if score >= 90:
        return 'A'
    elif score >= 80:
        return 'B'
    else:
        return 'C'

df['등급'] = df['점수'].apply(get_grade)

print(df)

    이름  나이 성별  점수 등급
0  김철수  20  남  88  B
1  이영희  19  여  95  A
2  박민수  21  남  81  B
3  최지연  20  여  99  A
4  정민호  22  남  91  A

In [58]:
import pandas as pd

# 샘플 데이터 생성
sales_data = {
    '주문번호': ['ORD001', 'ORD002', 'ORD003', 'ORD004', 'ORD005', 'ORD006'],
    '고객명': ['김철수', '이영희', '박민수', '김철수', '최지연', '이영희'],
    '상품명': ['노트북', '마우스', '키보드', '모니터', '노트북', '스피커'],
    '가격': [1200000, 25000, 80000, 300000, 1350000, 120000],
    '수량': [1, 2, 1, 1, 1, 1],
    '주문일': ['2024-01-15', '2024-01-16', '2024-01-16', '2024-01-17', '2024-01-17', '2024-01-18']
}

df_sales = pd.DataFrame(sales_data)

# '매출액' 컬럼 추가
df_sales['매출액'] = df_sales['가격'] * df_sales['수량']
# 전체 총 매출액 계산
total_sales = df_sales['매출액'].sum()
print("총 매출액:", total_sales)

총 매출액: 3100000

In [59]:
# 고객별 주문 횟수와 총 구매금액 집계
customer_summary = df_sales.groupby('고객명').agg(
    주문횟수=('주문번호', 'count'),
    총구매금액=('매출액', 'sum')
)
print(customer_summary)

     주문횟수    총구매금액
고객명
김철수     2  1500000
박민수     1    80000
이영희     2   170000
최지연     1  1350000

In [60]:
# 상품별 판매 수량 집계
product_counts = df_sales.groupby('상품명')['수량'].sum()
top_product = product_counts.idxmax()
top_product_qty = product_counts.max()
print(f"가장 많이 팔린 상품: {top_product} (총 {top_product_qty}개)")

가장 많이 팔린 상품: 노트북 (총 2개)

In [61]:
# 주문일별 매출액 집계
daily_sales = df_sales.groupby('주문일')['매출액'].sum()
print(daily_sales)

주문일
2024-01-15    1200000
2024-01-16     130000
2024-01-17    1650000
2024-01-18     120000
Name: 매출액, dtype: int64

In [63]:
# 10만원 이상 구매한 주문만 필터링
high_value_orders = df_sales[df_sales['매출액'] >= 100000]
print(high_value_orders)

     주문번호  고객명  상품명       가격  수량         주문일      매출액
0  ORD001  김철수  노트북  1200000   1  2024-01-15  1200000
3  ORD004  김철수  모니터   300000   1  2024-01-17   300000
4  ORD005  최지연  노트북  1350000   1  2024-01-17  1350000
5  ORD006  이영희  스피커   120000   1  2024-01-18   120000

In [64]:
max_qty = product_counts.max()
top_products = product_counts[product_counts == max_qty]

for product, qty in top_products.items():
    print(f"가장 많이 팔린 상품: {product} (총 {qty}개)")

가장 많이 팔린 상품: 노트북 (총 2개)
가장 많이 팔린 상품: 마우스 (총 2개)

In [66]:
# 새로운 행(row)을 추가 - 기존 행을 복사
df.loc['행5'] = df.loc[3]
print(df)

     이름  나이 성별  점수 등급
0   김철수  20  남  88  B
1   이영희  19  여  95  A
2   박민수  21  남  81  B
3   최지연  20  여  99  A
4   정민호  22  남  91  A
행5  최지연  20  여  99  A

In [67]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df = df.set_index('이름')
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [68]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0][3] = 80
print(df)

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

C:\Users\TAEKWONLEE\AppData\Local\Temp\ipykernel_20664\2135758478.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3] = 80
C:\Users\TAEKWONLEE\AppData\Local\Temp\ipykernel_20664\2135758478.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3] = 80

In [69]:
df.loc['서준']['체육'] = 90
print(df)

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

C:\Users\TAEKWONLEE\AppData\Local\Temp\ipykernel_20664\3794724790.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육'] = 90

In [70]:
df.loc['서준', '체육'] = 100
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [71]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 '음악', '체육' 점수
df.loc['서준', ['음악', '체육']] = 50
print(df)

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [72]:
df.loc['서준', ['음악', '체육']] = 100, 50
print(df)

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

In [73]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [74]:
## 데이터프레임 df를 전치하기 (메소드 활용)
df = df.transpose()
print(df)

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [75]:
# 데이터프레임 df를 다시 전치하기 (클래스 속성 활용)
df = df.T
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [76]:
import pandas as pd

# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [77]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정
ndf = df.set_index(['이름'])
print(ndf)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [78]:
ndf2 = ndf.set_index('음악')
print(ndf2)

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [79]:
ndf3 = ndf.set_index(['수학', '음악'])
print(ndf3)

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [80]:
import pandas as pd

# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [81]:
# 인덱스를 [r0, r1, r2, r3, r4]로 재지정
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [82]:
# reindex로 발생한 NaN값을 숫자 0으로 채우기
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [83]:
import pandas as pd

# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [84]:
# 행 인덱스를 정수형으로 초기화
ndf = df.reset_index()
print(ndf)

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [85]:
# 행 인덱스를 정수형으로 초기화하고, 기존 인덱스의 열 이름을 지정
ndf2 = df.reset_index(names=['C00'])
print(ndf2)

  C00  c0  c1  c2  c3  c4
0  r0   1   4   7  10  13
1  r1   2   5   8  11  14
2  r2   3   6   9  12  15

In [86]:
# 행 인덱스를 초기화하고, 기존 인덱스를 삭제
ndf3 = df.reset_index(drop=True)
print(ndf3)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [87]:
import pandas as pd

# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r2, r1]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r2', 'r1'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r2   2   5   8  11  14
r1   3   6   9  12  15

In [88]:
# 내림차순으로 행 인덱스 정렬
ndf = df.sort_index(ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   2   5   8  11  14
r1   3   6   9  12  15
r0   1   4   7  10  13

In [89]:
# 오름차순으로 행 인덱스 정렬
ndf2 = df.sort_index(ascending=True)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   3   6   9  12  15
r2   2   5   8  11  14

In [90]:
import pandas as pd

# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,10,11], 'c4':[15,14,14]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  15
r1   2   5   8  10  14
r2   3   6   9  11  14

In [91]:
# c1 열을 기준으로 내림차순 정렬
ndf = df.sort_values(by='c1', ascending=False)
print(ndf)

    c0  c1  c2  c3  c4
r2   3   6   9  11  14
r1   2   5   8  10  14
r0   1   4   7  10  15

In [92]:
# c2 열을 기준으로 오름차순 정렬
ndf2 = df.sort_values(by='c2', ascending=True)
print(ndf2)

    c0  c1  c2  c3  c4
r0   1   4   7  10  15
r1   2   5   8  10  14
r2   3   6   9  11  14

In [93]:
# c3 열을 기준으로 내림차순 정렬, c4 열을 기준으로 오름차순 정렬
ndf3 = df.sort_values(by=['c3', 'c4'], ascending=[False, True])
print(ndf3)

    c0  c1  c2  c3  c4
r2   3   6   9  11  14
r1   2   5   8  10  14
r0   1   4   7  10  15

In [94]:
import pandas as pd

# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [95]:
# 학생의 과목별 점수를 200으로 나누기
percentage = student1 / 200

print(percentage)

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [96]:
print(type(percentage))

<class 'pandas.core.series.Series'>

In [98]:
import pandas as pd

# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})

print(student1)
print('\n')
print(student2)

국어    100
영어     80
수학     90
dtype: int64


수학    80
국어    90
영어    80
dtype: int64

In [99]:
# 두 학생의 과목별 점수로 사칙연산 수행
addition = student1 + student2               #덧셈
print(type(addition))
print(addition)

<class 'pandas.core.series.Series'>
국어    190
수학    170
영어    160
dtype: int64

In [100]:
subtraction = student1 - student2            #뺄셈
print(type(subtraction))
print(subtraction)

<class 'pandas.core.series.Series'>
국어    10
수학    10
영어     0
dtype: int64

In [101]:
multiplication = student1 * student2         #곱셈
print(type(multiplication))
print(multiplication)

<class 'pandas.core.series.Series'>
국어    9000
수학    7200
영어    6400
dtype: int64

In [102]:
division = student1 / student2               #나눗셈
print(type(division))
print(division)

<class 'pandas.core.series.Series'>
국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [103]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [104]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

print(student1)
print(student2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64

In [105]:
# 두 학생의 과목별 점수로 사칙연산 수행 (시리즈 vs. 시리즈)
addition = student1 + student2               #덧셈
subtraction = student1 - student2            #뺄셈
multiplication = student1 * student2         #곱셈
division = student1 / student2               #나눗셈

print(type(division))

<class 'pandas.core.series.Series'>

In [106]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [107]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

print(student1)
print(student2)

국어     NaN
영어    80.0
수학    90.0
dtype: float64
수학    80
국어    90
dtype: int64

In [108]:
# 두 학생의 과목별 점수로 사칙연산 수행 (연산 메소드 사용)
sr_add = student1.add(student2, fill_value=0)    #덧셈
sr_sub = student1.sub(student2, fill_value=0)    #뺄셈
sr_mul = student1.mul(student2, fill_value=0)    #곱셈
sr_div = student1.div(student2, fill_value=0)    #나눗셈

# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
print(result)

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [109]:
# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]

print(df.head())   #첫 5행만 표시
print('\n')
print(type(df))

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500


<class 'pandas.core.frame.DataFrame'>

In [110]:
# 데이터프레임에 숫자 10 더하기
addition = df + 10
print(addition.head())   #첫 5행만 표시
print('\n')
print(type(addition))

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500


<class 'pandas.core.frame.DataFrame'>

In [111]:
# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.tail())          #마지막 5행을 표시
print('\n')
print(type(df))

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75


<class 'pandas.core.frame.DataFrame'>

In [112]:
# 데이터프레임에 숫자 10 더하기
addition = df + 10
print(addition.tail())    #마지막 5행을 표시
print('\n')
print(type(addition))

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75


<class 'pandas.core.frame.DataFrame'>

In [114]:
# 데이터프레임끼리 연산하기 (additon - df)
subtraction = addition - df
print(subtraction.tail())   #마지막 5행을 표시
print('\n')
print(type(subtraction))

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0


<class 'pandas.core.frame.DataFrame'>

In [115]:
# 사칙연산 수행 (연산 메소드 사용)
sample1 = addition.tail()
sample2 = subtraction.tail().fillna(0.0)

print(sample1)
print(sample2)

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75
      age  fare
886  10.0  10.0
887  10.0  10.0
888   0.0  10.0
889  10.0  10.0
890  10.0  10.0

In [116]:
df_add = sample1.add(sample2, fill_value=0)    #덧셈
df_sub = sample1.sub(sample2, fill_value=0)    #뺄셈
df_mul = sample1.mul(sample2, fill_value=0)    #곱셈
df_div = sample1.div(sample2, fill_value=0)    #나눗셈

print(df_add)
print(df_sub)
print(df_mul)
print(df_div)

      age   fare
886  47.0  33.00
887  39.0  50.00
888   0.0  43.45
889  46.0  50.00
890  52.0  27.75
      age   fare
886  27.0  13.00
887  19.0  30.00
888   0.0  23.45
889  26.0  30.00
890  32.0   7.75
       age   fare
886  370.0  230.0
887  290.0  400.0
888    0.0  334.5
889  360.0  400.0
890  420.0  177.5
     age   fare
886  3.7  2.300
887  2.9  4.000
888  NaN  3.345
889  3.6  4.000
890  4.2  1.775

In [117]:
# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# # titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')

# 행 인덱스 0~9 범위에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
df = titanic.loc[0:9, ['age','fare']]

# 데이터프레임 출력
df

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

In [118]:
# 조건식 적용 (20세 미만: age < 20)
df['age'] < 20

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9     True
Name: age, dtype: bool

In [119]:
# 불린 인덱싱 (20세 미만의 조건을 충족하는 행을 필터링)
df[df['age'] < 20]

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [120]:
# 불린 인덱싱 (loc 인덱서 활용)
df.loc[df['age'] < 20]

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [121]:
# 불린 인덱싱 (NOT 논리연산)
df.loc[~(df['age'] < 20)]

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
8  27.0  11.1333

In [122]:
# 나이가 10대(10~19세)인 승객 (AND 논리연산)
mask1 = (titanic.age >= 10) & (titanic.age < 20)
df_teenage = titanic[mask1]
df_teenage.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [123]:
# 나이가 10세 미만(0~9세)이고 여성인 승객 (AND 논리연산, loc 인덱서)
mask2 = (titanic.age < 10) & (titanic.sex == 'female')
df_female_under10 = titanic.loc[mask2]
df_female_under10.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
43,1,2,female,3.0,1,2,41.5792,C,Second,child,False,NaN,Cherbourg,yes,False
58,1,2,female,5.0,1,2,27.7500,S,Second,child,False,NaN,Southampton,yes,False
119,0,3,female,2.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False

In [124]:
# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객 (OR 논리연산)
# age, sex, alone 열만 선택 (loc 인덱서, fancy indexing)
mask3 = (titanic.age < 10) | (titanic.age >= 60)
df_under10_morethan60 = titanic.loc[mask3, ['age', 'sex', 'alone']]
df_under10_morethan60.head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

In [125]:
# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객 (OR 논리연산)
# age, sex, alone 열만 선택 (loc 인덱서, fancy indexing)
mask3 = (titanic.age < 10) | (titanic.age >= 60)
df_under10_morethan60 = titanic.loc[mask3, :]
df_under10_morethan60.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,1,21.075,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.700,S,Third,child,False,G,Southampton,yes,False
16,0,3,male,2.0,4,1,29.125,Q,Third,child,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,1,21.075,S,Third,child,False,NaN,Southampton,no,False
33,0,2,male,66.0,0,0,10.500,S,Second,man,True,NaN,Southampton,no,True

In [126]:
# 불린 시리즈를 새로운 열로 추가
df['age_under_20'] = df['age'] < 20
df.head()

    age     fare  age_under_20
0  22.0   7.2500         False
1  38.0  71.2833         False
2  26.0   7.9250         False
3  35.0  53.1000         False
4  35.0   8.0500         False

In [127]:
# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

# # titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')

# 행 인덱스 0~9 범위에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
df = titanic.loc[0:9, ['age','fare']]

# 데이터프레임 출력
df

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
7   2.0  21.0750
8  27.0  11.1333
9  14.0  30.0708

In [128]:
# 20세 미만의 조건을 충족하는 행을 필터링
df.query('age < 20')

    age     fare
7   2.0  21.0750
9  14.0  30.0708

In [129]:
# 나이가 20세 이상이고 요금이 15 미만인 조건을 모두 충족하는 행을 필터링
df.query('age >= 20 and fare < 15')

    age     fare
0  22.0   7.2500
2  26.0   7.9250
4  35.0   8.0500
8  27.0  11.1333

In [130]:
# 나이가 20세 이상 또는 요금이 15 미만인 조건을 하나라도 충족하는 행을 필터링
df.query('age >= 20 or fare < 15')

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583
6  54.0  51.8625
8  27.0  11.1333

In [131]:
# 라이브러리 불러오기
import seaborn as sns
import pandas as pd

# titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')

# 디스플레이 설정 변경 - 출력할 최대 열의 개수
pd.set_option('display.max_columns', 10)  
    
# 탑승한 도시가 "Southampton", "Queenstown"인 승객만 따로 추출 - 불린 인덱싱
mask1 = titanic['embark_town'] == "Southampton"
mask2 = titanic['embark_town'].str.match("Queenstown")
df_boolean = titanic[mask1 | mask2]
df_boolean.head()

,survived,pclass,sex,age,sibsp,...,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,...,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,...,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,...,False,C,Southampton,yes,False
4,0,3,male,35.0,0,...,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,...,True,NaN,Queenstown,no,True

In [132]:
# isin() 메서드 활용하여 동일한 조건으로 추출
isin_filter = titanic['embark_town'].isin(["Southampton", "Queenstown"])
df_isin = titanic[isin_filter]
df_isin.head()

,survived,pclass,sex,age,sibsp,...,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,...,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,...,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,...,False,C,Southampton,yes,False
4,0,3,male,35.0,0,...,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,...,True,NaN,Queenstown,no,True

In [133]:
# 라이브러리 불러오기
import pandas as pd

# 텍스트로 이루어진 시리즈 배열 만들기 (자료형 미지정)
fruit_names = pd.Series(["Apple", "Banana", "Cherry"])

# 시리즈 출력
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: object

In [134]:
df = pd.DataFrame({'과일': ['Apple', 'Banana', 'Cherry']})
print(df['과일'])

0     Apple
1    Banana
2    Cherry
Name: 과일, dtype: object

In [135]:
# 자료형 지정: 'string' 사용
pd.Series(["Apple", "Banana", "Cherry"], dtype="string")

0     Apple
1    Banana
2    Cherry
dtype: string

In [136]:
# 자료형 지정: pd.StringDtype() 사용
pd.Series(["Apple", "Banana", "Cherry"], dtype=pd.StringDtype())

0     Apple
1    Banana
2    Cherry
dtype: string

In [137]:
# 자료형 변환
fruit_names.astype('string')

0     Apple
1    Banana
2    Cherry
dtype: string

In [138]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

# 텍스트로 이루어진 시리즈 배열 만들기 (자료형 미지정)
ser = pd.Series(["Apple_사과", "Banana_바나나", "Cherry_체리", np.nan],
               index=["First ", " Second", " Third", "Fourth"])
print(ser)
print("\n")

# 텍스트로 이루어진 시리즈 배열 만들기 (string 자료형 지정)
ser2 = pd.Series(["Apple_사과", "Banana_바나나", "Cherry_체리", np.nan], 
                 index=["First ", " Second", " Third", "Fourth"], dtype="string")
print(ser2)

First        Apple_사과
 Second    Banana_바나나
 Third      Cherry_체리
Fourth            NaN
dtype: object


First        Apple_사과
 Second    Banana_바나나
 Third      Cherry_체리
Fourth           <NA>
dtype: string

In [139]:
# 소문자로 변환
print(ser.str.lower())
print("\n")

# 대문자로 변환
print(ser.str.upper())
print("\n")

# 문자열 길이 계산
print(ser.str.len())

First        apple_사과
 Second    banana_바나나
 Third      cherry_체리
Fourth            NaN
dtype: object


First        APPLE_사과
 Second    BANANA_바나나
 Third      CHERRY_체리
Fourth            NaN
dtype: object


First       8.0
 Second    10.0
 Third      9.0
Fourth      NaN
dtype: float64

In [140]:
# 문자열 분할
print(ser.str.split("_"))
print("\n")

# 문자열을 분할하여 DataFrame으로 확장
print(ser.str.split("_", expand=True))
print("\n")

# 분할된 문자열 중 특정 요소 선택
print(ser.str.split("_").str.get(1))

First        [Apple, 사과]
 Second    [Banana, 바나나]
 Third      [Cherry, 체리]
Fourth               NaN
dtype: object


              0    1
First     Apple   사과
 Second  Banana  바나나
 Third   Cherry   체리
Fourth      NaN  NaN


First       사과
 Second    바나나
 Third      체리
Fourth     NaN
dtype: object

In [142]:
# 행 인덱스를 추출
idx = ser.index
print(idx)

# 양쪽 공백 제거
print(idx.str.strip())

# 왼쪽 공백 제거
print(idx.str.lstrip())

# 오른쪽 공백 제거
print(idx.str.rstrip())

Index(['First ', ' Second', ' Third', 'Fourth'], dtype='object')
Index(['First', 'Second', 'Third', 'Fourth'], dtype='object')
Index(['First ', 'Second', 'Third', 'Fourth'], dtype='object')
Index(['First', ' Second', ' Third', 'Fourth'], dtype='object')

In [143]:
# 문자열 교체("_"을 찾아서 ":"으로 변경)
print(ser.str.replace("_", ":", regex=False))
print("\n")

# 정규 표현식을 사용한 문자열 교체(영문 알파벳이 아닌 문자 제거)
print(ser.str.replace("[^a-zA-Z\s]", "", regex=True))

First        Apple:사과
 Second    Banana:바나나
 Third      Cherry:체리
Fourth            NaN
dtype: object


First       Apple
 Second    Banana
 Third     Cherry
Fourth        NaN
dtype: object

In [144]:
# 인덱싱 - 각 문자열의 첫 번째 문자 선택
print(ser.str[0])
print("\n")

# 슬라이싱 - 각 문자열의 첫 번째 ~ 3번째 문자 선택
print(ser.str[0:4])

First        A
 Second      B
 Third       C
Fourth     NaN
dtype: object


First      Appl
 Second    Bana
 Third     Cher
Fourth      NaN
dtype: object

In [145]:
# 특정 문자 포함 여부 확인, NA 값을 False로 처리
contains_A = ser.str.contains("A", na=False)
print(contains_A)
print("\n")

# 패턴 포함 여부 확인
contains_pattern = ser.str.contains(r"[A|B][a-z]+")
print(contains_pattern)
print("\n")

# 전체 문자열의 패턴 일치 여부 확인
fullmatch_pattern = ser.str.fullmatch(r"[A|B][a-z]+")
print(fullmatch_pattern)

First       True
 Second    False
 Third     False
Fourth     False
dtype: bool


First       True
 Second     True
 Third     False
Fourth       NaN
dtype: object


First      False
 Second    False
 Third     False
Fourth       NaN
dtype: object

In [146]:
# 새로운 시리즈 생성
ser3 = pd.Series(["a1", "b2", "c3", "d4a5", "e6e7", "f8"], dtype="string")

# 숫자만 추출
digits = ser3.str.extractall(r"(\d)").groupby(level=0).agg(''.join)
print(digits)
print("\n")

# 알파벳만 추출
letters = ser3.str.extractall(r"([a-z])").groupby(level=0).agg(''.join)
print(letters)
print("\n")

# 숫자를 별도의 컬럼으로 분리
split_columns = ser3.str.extract(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)")
print(split_columns)

    0
0   1
1   2
2   3
3  45
4  67
5   8


    0
0   a
1   b
2   c
3  da
4  ee
5   f


  Letter Digit
0      a     1
1      b     2
2      c     3
3      d     4
4      e     6
5      f     8

In [153]:
import numpy as np
import pandas as pd

messy_data = {
    'Name': ['A', 'B', 'C', 'D', 'E'],
    'Age': [25, np.nan, 30, 28, np.nan],
    'Score': [85, 90, np.nan, 95, 88]
}
df_messy = pd.DataFrame(messy_data)

# 1. 결측치가 있는 행과 열 확인
print("Rows with missing values:\n", df_messy[df_messy.isnull().any(axis=1)])
print("Columns with missing values:", list(df_messy.columns[df_messy.isnull().any()]))

# 2. 'Age'의 결측치를 평균값으로 채우기 (대입 방식)
mean_age = df_messy['Age'].mean()
df_messy['Age'] = df_messy['Age'].fillna(mean_age)

# 3. 'Score'의 결측치를 중앙값으로 채우기 (대입 방식)
median_score = df_messy['Score'].median()
df_messy['Score'] = df_messy['Score'].fillna(median_score)

print("\nData after handling missing values:\n", df_messy)

Rows with missing values:
   Name   Age  Score
1    B   NaN   90.0
2    C  30.0    NaN
4    E   NaN   88.0
Columns with missing values: ['Age', 'Score']

Data after handling missing values:
   Name        Age  Score
0    A  25.000000   85.0
1    B  27.666667   90.0
2    C  30.000000   89.0
3    D  28.000000   95.0
4    E  27.666667   88.0

In [154]:
import pandas as pd

# 학생 기본정보
students = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '이름': ['김철수', '이영희', '박민수'],
    '학과': ['컴퓨터공학', '통계학', '경영학']
})

# 학생 성적정보
scores = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '수학': [85, 92, 78],
    '영어': [88, 85, 90]
})

# 1. 학번 기준 병합
df = pd.merge(students, scores, on='학번')

# 2. 평균점수 계산
df['평균점수'] = df[['수학', '영어']].mean(axis=1)

print(df)

     학번   이름     학과  수학  영어  평균점수
0  S001  김철수  컴퓨터공학  85  88  86.5
1  S002  이영희    통계학  92  85  88.5
2  S003  박민수    경영학  78  90  84.0